//=============================================================================
//
//	ゲーム背景[game bg.h]
//	Author:吉田　悠人
//
//=============================================================================

#ifndef _GAME_BG_H_
#define _GAME_BG_H_
//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "bg.h"
//=============================================================================
// クラス定義
//=============================================================================
class CGameBg :public CBgc
{
public:
	CGameBg(int nPriorit = PRIORITY_SCENE);	//コンストラクタ
	static HRESULT		Load(void);		//テクスチャ読み込み
	static void			Unload(void);	//テクスチャの破棄
	static CGameBg*		Create(void);	//生成処理
private:
	static TEXTURE_DATA	m_TextureData;	//テクスチャデータ

};
#endif