//=============================================================================
//
//	レーザーアイコン[laser icon.h]
//	Author:吉田　悠人
//
//=============================================================================

#ifndef _LASER_ICON_H_
#define _LASER_ICON_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "scene2d.h"

//=============================================================================
// クラス定義
//=============================================================================
class CLaserIcon :public CScene2d
{
public:
	CLaserIcon();	//コンストラクタ

	static HRESULT		Load(void);
	static void			Unload(void);
	static CLaserIcon*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);

private:
	static TEXTURE_DATA	m_TextureData;	// テクスチャデータ
};
#endif
