//=============================================================================
//
//	ライフUI[life ui.h]
//	Author:吉田　悠人
//
//=============================================================================
#ifndef _LIFE_UI_H_
#define _LIFE_UI_H_
//=============================================================================
//ヘッダーファイル
//=============================================================================
#include "main.h"
#include "scene2d.h"
//=============================================================================
//前方宣言
//=============================================================================
class CUi;
//=============================================================================
// クラス定義
//=============================================================================
class CLifeUi :public CScene2d
{
public:
	CLifeUi(int nPriorit = PRIORITY_UI_3);		//コンストラクタ

	static HRESULT	Load(void);		//テクスチャ読み込み
	static void		Unload(void);	//テクスチャの破棄
	static CLifeUi*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);	//生成処理

private:
	static TEXTURE_DATA	m_TextureData;	//テクスチャデータ
};



#endif
