//=============================================================================
//
// リンゴブロック [apple block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _AOOKE_BLOCK_H_
#define _AOOKE_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "item block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CAppleBlock : public CItemBlockBase
{
public:
	CAppleBlock();
	~CAppleBlock();
	static CAppleBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);

private:
	const int					m_nModel = 42;	// モデル番号

};
#endif