//=============================================================================
//
// ゴミブロック [garbage block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _GARBAGE_BLOCK_H_
#define _GARBAGE_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "item block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CGarbageBlock : public CItemBlockBase
{
public:
	CGarbageBlock();
	~CGarbageBlock();
	static CGarbageBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);

private:
	const int					m_nModel = 40;	// モデル番号

};
#endif