//=============================================================================
//
// ブドウブロック [grapes block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _GRAPES_BLOCK_H_
#define _GRAPES_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "item block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CGrapesBlock : public CItemBlockBase
{
public:
	CGrapesBlock();
	~CGrapesBlock();
	static CGrapesBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);

private:
	const int					m_nModel = 45;	// モデル番号

};
#endif