//=============================================================================
//
// 草ブロック [grass block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _GRASS_BLOCK_H_
#define _GRASS_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "tile block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CGrassBlock : public CTileBlockBase
{
public:
	CGrassBlock();
	~CGrassBlock();
	static CGrassBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);

private:
	const int	 m_nModel = 12;					// モデル番号

};
#endif