//=============================================================================
//
// ミカンブロック [oranges block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _ORANGES_BLOCK_H_
#define _ORANGES_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "item block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class COrangesBlock : public CItemBlockBase
{
public:
	COrangesBlock();
	~COrangesBlock();
	static COrangesBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);

private:
	const int					m_nModel = 43;	// モデル番号

};
#endif