//=============================================================================
//
// 赤砂ブロック [red sand block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _RED_SAND_BLOCK_H_
#define _RED_SAND_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "tile block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CRedSandBlock : public CTileBlockBase
{
public:
	CRedSandBlock();
	~CRedSandBlock();
	static CRedSandBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);

private:
	const int					m_nModel = 10;	// モデル番号

};
#endif