//=============================================================================
//
// 砂ブロック [sand block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _SAND_BLOCK_H_
#define _SAND_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "tile block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CSandBlock : public CTileBlockBase
{
public:
	CSandBlock();
	~CSandBlock();
	static CSandBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);

private:
	const int	 m_nModel = 11;				// モデル番号

};
#endif