//=============================================================================
//
// 種ブロック [seeds block.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _SEEDS_BLOCK_H_
#define _SEEDS_BLOCK_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "item block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CSeedsBlock : public CItemBlockBase
{
public:
	CSeedsBlock();
	~CSeedsBlock();
	static CSeedsBlock*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);
private:
	const int					m_nModel = 41;	// モデル番号

};
#endif