//=============================================================================
//
// 針葉樹(小さい) [small tree.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _SMALL_TREE_H_
#define _SMALL_TREE_H_
//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "hindrance block base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CSmallTree : public CHindranceBlockBase
{
public:
	CSmallTree();
	~CSmallTree();
	static CSmallTree*	Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);

private:
	const int					m_nModel = 53;	// モデル番号

};
#endif