//=============================================================================
//
//	セリフNo.5[talk no5.h]
//	Author:吉田 悠人
//
//=============================================================================

// 二重インクルード防止
#ifndef _TALK_NO5_H_
#define _TALK_NO5_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "talk_base.h"

//=============================================================================
// クラス定義
//=============================================================================
class CTalkNo5 :public CTalkbase
{
public:
	CTalkNo5(int nPriorit = PRIORITY_UI_0);	// コンストラクタ
	static CTalkNo5* Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	HRESULT		Init(void);				// 初期化処理

protected:
	const int m_nTexture = 14;			// テクスチャ番号

};
#endif
