//=============================================================================
//
//	セリフNo6 [talk no6.cpp]
//	Author:吉田 悠人
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "resource manager.h"
#include "inputkeyboard.h"
#include "inputcontroller.h"
#include "renderer.h"
#include "talk no6.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define TALK_APPEAR (360)	//出現している時間

//=============================================================================
// コンストラクタ
//=============================================================================
CTalkNo6::CTalkNo6(int nPriorit)
{
}

//=============================================================================
// 生成処理
//=============================================================================
CTalkNo6 * CTalkNo6::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリ確保
	CTalkNo6* pTalkNo6 = nullptr;
	pTalkNo6 = new CTalkNo6;
	//リソース確保
	CResource* pResource = CManager::GetResource();
	LPDIRECT3DTEXTURE9 Texture = pResource->TextureLoad(pTalkNo6->m_nTexture);

	//NULLチェック
	if (pTalkNo6 != nullptr)
	{
		//位置設定
		pTalkNo6->SetPos(pos);
		//サイズ設定
		pTalkNo6->SetSize(size);
		//テクスチャ設定
		pTalkNo6->BindTexture(Texture);
		//初期化処理
		pTalkNo6->Init();
	}
	return pTalkNo6;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTalkNo6::Init(void)
{
	//出現している時間セット
	SetAppear(TALK_APPEAR);
	//フェード状況設定
	SetFade(FADE_IN);

	//初期化処理
	CTalkbase::Init();
	return S_OK;
}
