//=============================================================================
//
// スコア助数詞(マイ)のUI [classifier.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _CLASSIFIER_H_
#define _CLASSIFIER_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "scene2d.h"

//=============================================================================
// クラス定義
//=============================================================================
class CClassifier :public CScene2d
{
public:
	CClassifier();
	~CClassifier();

	static CClassifier *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);

private:
	const int nClassifierTexture = 51;		//テクスチャ番号
};

#endif