//=============================================================================
//
// 寿司　エビパーツ [ebi parts.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _EBI_PARTS_H_
#define _EBI_PARTS_H_
//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "model.h"
#include "player parts.h"

//=============================================================================
// クラス定義
//=============================================================================
class CEbiParts :public CPlayerParts
{
public:
	CEbiParts();

	static CEbiParts* Create(D3DXVECTOR3 Pos, D3DXVECTOR3 Rot, D3DXVECTOR3 Size, CScene3d* pParent);


private:
	const int m_nTexture = 10;		// テクスチャ番号
};

#endif