//=============================================================================
//
// 寿司　エビ [ebi.cpp]
// Author : 吉田悠人
//
//=============================================================================

//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "ebi.h"
#include "resource manager.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define EBI_SCORE (10)

//=============================================================================
// コンストラクタ
//=============================================================================
CEbi::CEbi()
{

}

//=============================================================================
// 生成処理関数
//=============================================================================
CEbi * CEbi::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリの確保
	CEbi *pEbi;
	pEbi = new CEbi;

	//リソース確保(リソースマネージャーから呼び出す)
	CResource* pResource = CManager::GetResource();
	LPDIRECT3DTEXTURE9 Texture = pResource->TextureLoad(pEbi->m_nTexture);

	//NULLチェック
	if (pEbi != NULL)
	{
		pEbi->SetPos(pos);			// 位置設定
		pEbi->SetSize(size);		// サイズ設定
		pEbi->SetPoint(EBI_SCORE);	// スコア設定
		pEbi->BindTexture(Texture);	// テクスチャ設定
		pEbi->SetFoodType(TYPE_EBI);// タイプ設定
		pEbi->Init();				// 初期化処理
	}

	return pEbi;
}
