//=============================================================================
//
//　パワーUpエフェクト処理 [effect powerup.h]
// Author : 林川紗梨夏
//
//=============================================================================
#ifndef _EFFECT_POWERUP_H_
#define _EFFECT_POWERUP_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene3d.h"
#include "meshfield cylinder.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CEffectPowerUP :public CScene3d
{
public:
	CEffectPowerUP(int nPriority = 7);
	~CEffectPowerUP();
	static CEffectPowerUP * Create(D3DXVECTOR3 Pos, D3DXVECTOR3 Size,CPlayer * pPlayer);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	CPlayer * m_pPlayer;		// プレイヤーのポインタ
	D3DXVECTOR3 m_Move;
	int		m_nTime;//滞在時間
	const int               m_nTexture = 30;//テクスチャ番号
};
#endif