//=============================================================================
//
// 寿司　卵パーツ [egg parts.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _EGG_PARTS_H_
#define _EGG_PARTS_H_
//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "model.h"
#include "food base.h"
#include "player parts.h"

//=============================================================================
// クラス定義
//=============================================================================
class CEggParts :public CPlayerParts
{
public:
	CEggParts();

	static CEggParts* Create(D3DXVECTOR3 Pos, D3DXVECTOR3 Rot, D3DXVECTOR3 Size, CScene3d* pParent);


private:
	const int m_nTexture = 14;		// テクスチャ番号
};

#endif