//=============================================================================
//
// 寿司　卵 [egg.cpp]
// Author : 吉田悠人
//
//=============================================================================

//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "egg.h"
#include "resource manager.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define EGG_SCORE (10)

//=============================================================================
// コンストラクタ
//=============================================================================
CEgg::CEgg()
{

}

//=============================================================================
// 生成処理関数
//=============================================================================
CEgg * CEgg::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリの確保
	CEgg *pEgg;
	pEgg = new CEgg;

	//リソース確保(リソースマネージャーから呼び出す)
	CResource* pResource = CManager::GetResource();
	LPDIRECT3DTEXTURE9 Texture = pResource->TextureLoad(pEgg->m_nTexture);

	//NULLチェック
	if (pEgg != NULL)
	{
		pEgg->SetPos(pos);			// 位置設定
		pEgg->SetSize(size);		// サイズ設定
		pEgg->SetPoint(EGG_SCORE);	// スコア設定
		pEgg->BindTexture(Texture);	// テクスチャ設定
		pEgg->SetFoodType(TYPE_EGG);// タイプ設定
		pEgg->Init();				// 初期化処理
	}

	return pEgg;
}
