//=============================================================================
//
// 寿司　イクラパーツ [ikura parts.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _IKURA_PARTS_H_
#define _IKURA_PARTS_H_
//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "model.h"
#include "player parts.h"

//=============================================================================
// クラス定義
//=============================================================================
class CIkuraParts :public CPlayerParts
{
public:
	CIkuraParts();

	static CIkuraParts* Create(D3DXVECTOR3 Pos, D3DXVECTOR3 Rot, D3DXVECTOR3 Size, CScene3d* pParent);


private:
	const int m_nTexture = 11;		// テクスチャ番号
};

#endif