
//=============================================================================
//
// 寿司　いくら [ikura.cpp]
// Author : 吉田悠人
//
//=============================================================================

//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "ikura.h"
#include "resource manager.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define IKURA_SCORE (10)

//=============================================================================
// コンストラクタ
//=============================================================================
CIkura::CIkura()
{

}

//=============================================================================
// 生成処理関数
//=============================================================================
CIkura * CIkura::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリの確保
	CIkura *pIkura;
	pIkura = new CIkura;

	//リソース確保(リソースマネージャーから呼び出す)
	CResource* pResource = CManager::GetResource();
	LPDIRECT3DTEXTURE9 Texture = pResource->TextureLoad(pIkura->m_nTexture);

	//NULLチェック
	if (pIkura != NULL)
	{
		pIkura->SetPos(pos);			// 位置設定
		pIkura->SetSize(size);			// サイズ設定
		pIkura->SetPoint(IKURA_SCORE);	// スコア設定
		pIkura->BindTexture(Texture);	// テクスチャ設定
		pIkura->SetFoodType(TYPE_IKURA);// タイプ設定
		pIkura->Init();					// 初期化処理
	}

	return pIkura;
}
