//=============================================================================
// リザルト処理 [result.h]
// Author : 吉田悠人
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=============================================================================
// インクルード
//=============================================================================
#include "scene.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CScore;
class CCamera;

//=============================================================================
//クラス
//=============================================================================
class CResult : public CScene
{
public:
	CResult();
	~CResult();
	static CResult *Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void ScoreCreate(D3DXVECTOR3 pos, D3DXVECTOR3 size,int nPlayer);	//スコア生成処理
private:
	static CCamera*	m_pCamera;	//カメラポインタ
	CScore*			m_pScore;	//スコアポインタ

};
#endif