//=============================================================================
//
// 寿司　サーモンパーツ [salmon parts.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _SALMON_PARTS_H_
#define _SALMON_PARTS_H_
//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "model.h"
#include "player parts.h"

//=============================================================================
// クラス定義
//=============================================================================
class CSalmonParts :public CPlayerParts
{
public:
	CSalmonParts();

	static CSalmonParts* Create(D3DXVECTOR3 Pos, D3DXVECTOR3 Rot, D3DXVECTOR3 Size, CScene3d* pParent);


private:
	const int m_nTexture = 13;		// テクスチャ番号
};

#endif