//=============================================================================
//
// 寿司　マグロパーツ [tuna parts.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _TUNA_PARTS_H_
#define _TUNA_PARTS_H_
//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "model.h"
#include "player parts.h"

//=============================================================================
// クラス定義
//=============================================================================
class CTunaParts :public CPlayerParts
{
public:
	CTunaParts();

	static CTunaParts* Create(D3DXVECTOR3 Pos, D3DXVECTOR3 Rot, D3DXVECTOR3 Size, CScene3d* pParent);


private:
	const int m_nTexture = 12;		// テクスチャ番号
};

#endif