//=============================================================================
//
// 寿司　マグロ [tuna.cpp]
// Author : 吉田悠人
//
//=============================================================================

//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "tuna.h"
#include "resource manager.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define TUNA_SCORE (10)

//=============================================================================
// コンストラクタ
//=============================================================================
CTuna::CTuna() 
{

}

//=============================================================================
// 生成処理関数
//=============================================================================
CTuna * CTuna::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリの確保
	CTuna *pTuna;
	pTuna = new CTuna;

	//リソース確保(リソースマネージャーから呼び出す)
	CResource* pResource = CManager::GetResource();
	LPDIRECT3DTEXTURE9 Texture = pResource->TextureLoad(pTuna->m_nTexture);

	//NULLチェック
	if (pTuna != NULL)
	{
		pTuna->SetPos(pos);				// 位置設定
		pTuna->SetSize(size);			// サイズ設定
		pTuna->SetPoint(TUNA_SCORE);	// スコア設定
		pTuna->BindTexture(Texture);	// テクスチャ設定
		pTuna->SetFoodType(TYPE_TUNA);	// タイプ設定
		pTuna->Init();					// 初期化処理
	}

	return pTuna;
}
