//=============================================================================
//
// winnerのUI [winner.cpp]
// Author : 吉田悠人
//
//=============================================================================

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "winner.h"
#include "resource manager.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CWinner::CWinner()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CWinner::~CWinner()
{
}

//=============================================================================
// 生成処理
//=============================================================================
CWinner * CWinner::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリ確保
	CWinner *pWinner;
	pWinner = new CWinner;
	//リソース確保(リソースマネージャーから呼び出す)
	CResource* pResource = CManager::GetResource();
	LPDIRECT3DTEXTURE9 Texture = pResource->TextureLoad(pWinner->nWinnerTexture);

	//NULLチェック
	if (pWinner != nullptr)
	{
		pWinner->BindTexture(Texture);
		pWinner->SetPos(pos);
		pWinner->SetSize(size);
		pWinner->Init();
	}
	return pWinner;
}
